
## Terraform plan for environment: `dev`

**Commit:** e7c00f9f4dcd95bea0e27ba6ff0bf5b0717e6a3c


**API version:** 802463b33a
**CLI version:** 802463b33a
**Selfserve version:** 802463b33a
**Internal version:** 802463b33a

### Plan summary

`0 to add, 5 to change, 0 to destroy`

**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:222" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:222"
        name                       = "vol-app-dev-import-anondb"
      ~ revision                   = 222 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:222" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:222"
        name                       = "vol-app-dev-ni-compliance"
      ~ revision                   = 222 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:222" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:222"
        name                       = "vol-app-dev-populate-anondb"
      ~ revision                   = 222 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:222" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:222"
        name                       = "vol-app-dev-sas-mi-extract"
      ~ revision                   = 222 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:291",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:291",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:291",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-removal:1",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:293",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:293",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:290",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:292",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-dev-batch-scheduler-inline"
        name             = "vol-app-dev-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:292",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:222",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:293",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:293",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:222",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:222",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:222",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-removal:1",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:291",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:291",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:291",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:290",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:290",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-dev-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

```

</details>